Repository: magiauy/PhoneStore
Catalog: PhoneStoreAdmin/Resources/Strings/*/Common.resw
Source language: en_us
Languages: vi_vn

# CancelButton.Content
source: Cancel
vi_vn: Hủy

# View.Content
source: View
vi_vn: Xem

# OK.Content
source: OK
vi_vn: Đồng Ý

# UnexpectedError.Text
source: An unexpected error occurred
vi_vn: Có lỗi không mong muốn xảy ra

# ProcessingText.Text
source: Processing...
vi_vn: Đang xử lý...

# EmailLabel.Text
source: Email Address
vi_vn: Địa Chỉ Email

# FullNameLabel.Text
source: Full Name
vi_vn: Họ và Tên

# PhoneLabel.Text
source: Phone Number
vi_vn: Số Điện Thoại

# FullNamePlaceholder.PlaceholderText
source: Enter your full name
vi_vn: Nhập họ và tên của bạn

# PhonePlaceholder.PlaceholderText
source: Enter your phone number (optional)
vi_vn: Nhập số điện thoại (tùy chọn)

# EmailRequired.Text
source: Email is required
vi_vn: Email là bắt buộc

# EmailInvalid.Text
source: Please enter a valid email address
vi_vn: Vui lòng nhập địa chỉ email hợp lệ

# FullNameRequired.Text
source: Full name is required
vi_vn: Họ và tên là bắt buộc

# FullNameTooShort.Text
source: Full name must be at least 2 characters
vi_vn: Họ và tên phải có ít nhất 2 ký tự

# PhoneInvalid.Text
source: Please enter a valid phone number
vi_vn: Vui lòng nhập số điện thoại hợp lệ

# BtnClearFilter.Content
source: Clear Filter
vi_vn: Xóa bộ lọc

# ComboBoxItemActivate.Content
source: Activate
vi_vn: Hoạt động

# ComboBoxItemDe Activate.Content
source: De activate
vi_vn: Ngưng hoạt động

# ComboBoxItemAll.Content
source: All
vi_vn: Tất cả

# SelectBoxAllValue.Content
source: All
vi_vn: Tất cả

# SelectBoxInActivateValue.Content
source: Inactive
vi_vn: Ngưng hoạt động

# SelectBoxActivateValue.Content
source: Activate
vi_vn: Hoạt động

# Status_Active
source: Active
vi_vn: Hoạt động

# Status_Inactive
source: Inactive
vi_vn: Ngưng hoạt động

# EmptyStateTitle.Text
source: No found
vi_vn: Không có dữ liệu

# EmptyStateDescription.Text
source: There are no to display. Add a new or check your filters.
vi_vn: Chưa có dữ liệu để hiển thị. Hãy thêm dữ liệu mới hoặc kiểm tra lại bộ lọc.

# ColCreatedAt.Text
source: CREATED AT
vi_vn: NGÀY TẠO

# FilterCreatedDateFrom.Text
source: Created date from
vi_vn: Ngày tạo từ

# FilterCreatedDateTo.Text
source: Created date to
vi_vn: Ngày tạo đến

# FilterNote.Text
source: Note
vi_vn: Ghi chú

# NameRequired/Text
source: Name is required (min 2 characters)
vi_vn: Tên là bắt buộc (tối thiểu 2 ký tự)

# InvalidPhone/Text
source: Invalid phone format
vi_vn: Định dạng điện thoại không hợp lệ

# InvalidEmail/Text
source: Invalid email format
vi_vn: Định dạng email không hợp lệ

# InvalidTaxNumber/Text
source: Invalid tax number (10 or 13 digits)
vi_vn: Mã số thuế không hợp lệ (10 hoặc 13 chữ số)

# UnexpectedError/Text&quot;
source: An unexpected error occurred:
vi_vn: Đã xảy ra lỗi không mong muốn:

# AddButton/Text
source: Add
vi_vn: Thêm

# UpdateButton/Text
source: Update
vi_vn: Cập nhật

# CloseButton/Text
source: Close
vi_vn: Đóng

# LoadError/Text
source: Failed to load data:
vi_vn: Không thể tải dữ liệu

# AddressPlaceholder.PlaceholderText
source: Enter address (optional)
vi_vn: Nhập địa chỉ (tùy chọn)

# TaxNumberPlaceholder.PlaceholderText
source: Enter tax number (optional)
vi_vn: Nhập mã số thuế (tùy chọn)

# BtnConfirm
source: Confirm
vi_vn: Xác nhận

# BtnCancel
source: Cancel
vi_vn: Hủy

# BtnAddButton.Text
source: Add
vi_vn: Thêm

# InputCost.Header
source: Cost
vi_vn: Giá

# InputQuantity.Header
source: Quantity
vi_vn: Số lượng

# TxtTotal.Text
source: Total
vi_vn: Tổng cộng

source: Select
vi_vn: Chọn

# TxtSubTotal.Text
source: Subtotal:
vi_vn: Tạm tính:

# TotalAmountLabel
source: Total amount
vi_vn: Tổng tiền

source: Cannot load data
vi_vn: Không thể tải dữ liệu

# QuantityLabel.Text
source: Qty:
vi_vn: SL:

# UnitCostLabel.Text
source: Unit Cost:
vi_vn: Đơn giá:

# ViewDeviceDetailsHeader.Text
source: View Device Details
vi_vn: Xem chi tiết máy

# SubtotalLabel.Text
source: Subtotal:
vi_vn: Tạm tính:

# TotalLabel.Text
source: Total:
vi_vn: Tổng cộng:

# ValidationErrorTitle
source: Input Error
vi_vn: Lỗi nhập liệu

# ValidationErrorInfoBar.Title
source: Input Error
vi_vn: Lỗi nhập liệu

# ValidationErrorInfoBar.Message
source: Please enter Serial Number and IMEI 1 for all devices
vi_vn: Vui lòng nhập đầy đủ Số Serial và IMEI 1 cho tất cả các máy

# Dlg_PODetails_Title
source: Purchase Order Details
vi_vn: Chi tiết phiếu nhập

# Dlg_PODetails_OrderDetailsTitle
source: Order Details
vi_vn: Chi tiết đơn hàng

# Dlg_PODetails_CreatedByLabel
source: Created By:
vi_vn: Người tạo:

# Dlg_PODetails_TotalAmountLabel
source: Total Amount:
vi_vn: Tổng tiền:

# Dlg_PODetails_NoteLabel
source: Note:
vi_vn: Ghi chú:

# Dlg_PODetails_OrderLinesTitle
source: Order Lines ({0})
vi_vn: Chi tiết sản phẩm ({0})

# Dlg_PODetails_QtyLabel
source: Qty:
vi_vn: SL:

# Dlg_PODetails_UnitLabel
source: Unit:
vi_vn: Đơn giá:

# Dlg_PODetails_CloseButton
source: Close
vi_vn: Đóng

# Common_NA
source: N/A
vi_vn: Không có

# Common_Unknown
source: Unknown
vi_vn: Không xác định

# Common_NoNotes
source: No notes
vi_vn: Không có ghi chú

# Common_UserIdFormat
source: User ID: {0}
vi_vn: Người dùng ID: {0}

# Common_POFormat
source: PO #{0}
vi_vn: PN #{0}

# Common_OpenFile
source: Open File
vi_vn: Mở File

# Common/NotAvailable
source: N/A
vi_vn: Chưa có

# Common/Cancel
source: Cancel
vi_vn: Hủy

# Common/Create
source: Create
vi_vn: Thêm

# Common/Save
source: Save
vi_vn: Lưu

# Common/Delete
source: Delete
vi_vn: Xóa

# Common/Edit
source: Edit
vi_vn: Sửa

# Common/PreviousPage
source: Previous Page
vi_vn: Trang trước

# Common/NextPage
source: Next Page
vi_vn: Trang sau

source: Loading...
vi_vn: Đang tải...

source: Loading Data...
vi_vn: Đang tải dữ liệu...

# Common/AccountManagement
source: Account Management
vi_vn: Quản lý tài khoản

# Common/Success
source: Success
vi_vn: Thành công

# Common/Close
source: Close
vi_vn: Đóng

# DialogAdd
source: Add
vi_vn: Thêm

# DialogUpdate
source: Update
vi_vn: Cập nhật

# DialogCancel
source: Cancel
vi_vn: Hủy

# DiscountAmountGreaterThanZeroError
source: Discount amount must be greater than 0
vi_vn: Số tiền giảm giá phải lớn hơn 0

# MinimumAmountNonNegativeError
source: Minimum amount cannot be negative
vi_vn: Số tiền tối thiểu không được âm

# FilterStatusLabel.Text
source: Status
vi_vn: Trạng thái

# FilterOptionAll
source: All
vi_vn: Tất cả

# UnknownCategoryLabel
source: Uncategorized
vi_vn: Chưa phân loại

# UnknownAttributeLabel
source: Attribute
vi_vn: Thuộc tính

# DialogCloseButton
source: Close
vi_vn: Đóng

# GenericDialogTitle
source: Notification
vi_vn: Thông báo
